In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
# importing the dataset

ds = sns.load_dataset('titanic')

ds.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [4]:
round(ds.isnull().sum() / len(ds) * 100,2).sort_values(ascending=False)

deck           77.22
age            19.87
embarked        0.22
embark_town     0.22
survived        0.00
pclass          0.00
sex             0.00
sibsp           0.00
parch           0.00
fare            0.00
class           0.00
who             0.00
adult_male      0.00
alive           0.00
alone           0.00
dtype: float64

In [5]:
ds.isnull().sum().sort_values(ascending=False)

deck           688
age            177
embarked         2
embark_town      2
survived         0
pclass           0
sex              0
sibsp            0
parch            0
fare             0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

In [6]:
ds['age'].fillna(ds['age'].median(), inplace=True)

In [7]:
ds.drop('deck', axis=1, inplace=True)

In [8]:
ds['embark_town'].fillna(ds['embark_town'].mode()[0], inplace=True)
ds['embarked'].fillna(ds['embarked'].mode()[0], inplace=True)

# from sklearn (missing values imputing)

In [9]:
from sklearn.impute import SimpleImputer  # univariate imputation

In [10]:
imputer = SimpleImputer(strategy='median')
ds['age'] = imputer.fit_transform(ds[['age']])

In [11]:
from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import IterativeImputer  # multivariate imputation


imputer = IterativeImputer(max_iter=10, random_state=0,n_nearest_features=2)
ds['age'] = imputer.fit_transform(ds[['age']])

# forward fill and backward fill

In [12]:
ds['age'] = ds['age'].ffill()
ds['age'] = ds['age'].bfill()

# using KNN imputer

In [13]:
from sklearn.impute import KNNImputer  # multivariate imputation

imputer = KNNImputer(n_neighbors=2)
ds['age'] = imputer.fit_transform(ds[['age']])

In [20]:
from sklearn.preprocessing import StandardScaler, MinMaxScaler, MaxAbsScaler

scaler = StandardScaler()

ds['age'] = scaler.fit_transform(ds[['age']])
ds['fare'] = scaler.fit_transform(ds[['fare']])

In [18]:
ds['fare'].head()

0   -0.502445
1    0.786845
2   -0.488854
3    0.420730
4   -0.486337
Name: fare, dtype: float64